Tekla Open API Reference for Tekla Structures 2025
LoadGroup.Colors Enumeration
 The possible display colors for loads in a load group.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum Colors
Public Enumeration Colors
Members
Member name | Value | Description
BLACK | 0 |  The black display color.
WHITE | 1 |  The white display color.
RED | 2 |  The red display color.
GREEN | 3 |  The green display color.
BLUE | 4 |  The blue display color.
CYAN | 5 |  The cyan display color.
YELLOW | 6 |  The yellow display color.
MAGENTA | 7 |  The magenta display color.
See Also
Reference
Tekla.Structures.Model Namespace